//---------------------------------------------------------
// 
//	iruna_vector3.h
//	ベクトル3関連
//	作成日 6月22日
//	製作者 立川 翔野
// 
//---------------------------------------------------------

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_VECTOR3_H
#define IRUNA_VECTOR3_H

namespace iruna
{
namespace math
{

//---------------------------------------------------------
// 
//	クラス名	:	Vector3
//	作成日		:	6月23日
//	製作者		:	立川 翔野
// 
//---------------------------------------------------------
typedef	D3DXVECTOR3	Vector3;

}	//	math	end
}	//	iruna	end

#endif	//	IRUNA_VECTOR3_H	end