//---------------------------------------------------------
// 
//	iruna_matrix.h
//	行列関連
//	作成日 6月23日
//	製作者 立川 翔野
// 
//---------------------------------------------------------

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_MATRIX_H
#define IRUNA_MATRIX_H

/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"

namespace iruna
{
namespace math
{

//---------------------------------------------------------
// 
//	クラス名	:	Matrix
//	作成日		:	6月23日
//	製作者		:	立川 翔野
// 
//---------------------------------------------------------
typedef	D3DXMATRIX	Matrix;

//=====================================================================
//
//	クラス名	:	WoldMatrix
//	処理		:	拡張型ワールド行列
//	製作者		:	立川 翔野
//	作成日		:	2011/08/06	- 作成
//
//=====================================================================
class WoldMatrix
{
//	プライベート	メンバ変数
private:
	Matrix tran;	//	平行移動行列
	Matrix rota;	//	回転行列
	Matrix scal;	//	拡大縮小行列

//	パブリック	メンバ関数
public:

	//--------------------------------------------------------------------
	// 
	//	処理	:	コンストラクタ
	//	製作者	:	立川 翔野
	//	作成日	:	2011/08/06	- 作成
	// 
	//--------------------------------------------------------------------
	WoldMatrix();

	//--------------------------------------------------------------------
	// 
	//	処理	:	指定されたベクトルで平行移動行列を作成する
	//	第1引数	:	[in] vecX		- x軸成分
	//	第2引数	:	[in] vecY		- y軸成分
	//	第3引数	:	[in] vecZ		- z軸成分
	//	製作者	:	立川 翔野
	//	作成日	:	2011/08/06	- 作成
	// 
	//--------------------------------------------------------------------
	void SetTranslation( float vecX, float vecY, float vecZ );

	//--------------------------------------------------------------------
	// 
	//	処理	:	指定されたラジアン角で回転行列を作成
	//	第1引数	:	[in] radX		- x軸成分
	//	第2引数	:	[in] radY		- y軸成分
	//	第3引数	:	[in] radZ		- z軸成分
	//	製作者	:	立川 翔野
	//	作成日	:	2011/08/06	- 作成
	// 
	//--------------------------------------------------------------------
	void SetRotation( float radX, float radY, float radZ );

	//--------------------------------------------------------------------
	// 
	//	処理	:	指定されたベクトルで拡大縮小行列を作成
	//	第1引数	:	[in] scalX		- x軸成分
	//	第2引数	:	[in] scalY		- y軸成分
	//	第3引数	:	[in] scalZ		- z軸成分
	//	製作者	:	立川 翔野
	//	作成日	:	2011/08/06	- 作成
	// 
	//--------------------------------------------------------------------
	void SetScal( float scalX, float scalY, float scalZ );

	//--------------------------------------------------------------------
	// 
	//	処理	:	設定された移動・回転・大きさの行列からワールド行列を作成
	//	戻り値	:	計算したワールド行列
	//	製作者	:	立川 翔野
	//	作成日	:	2011/08/06	- 作成
	// 
	//--------------------------------------------------------------------
	Matrix GetWoldMatrix();

};

}	//	math	end
}	//	iruna	end

#endif	//	IRUNA_MATRIX_H	end