//---------------------------------------------------------
// 
//	iruna_vector4.h
//	ベクトル4関連
//	作成日 6月22日
//	製作者 立川 翔野
// 
//---------------------------------------------------------

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_VECTOR4_H
#define IRUNA_VECTOR4_H

namespace iruna
{
namespace math
{

//---------------------------------------------------------
// 
//	クラス名	:	Vector4
//	作成日		:	6月23日
//	製作者		:	立川 翔野
// 
//---------------------------------------------------------
typedef	D3DXVECTOR4	Vector4;

}	//	math	end
}	//	iruna	end

#endif	//	IRUNA_VECTOR4_H	end