//---------------------------------------------------------
// 
//	iruna_color4.h
//	RGBAの色関係を扱う
//	作成日 6月23日
//	製作者 立川 翔野
// 
//---------------------------------------------------------

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_COLOR4_H
#define IRUNA_COLOR4_H

/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"

/*----データ型 宣言------------------------------------------------*/
namespace iruna
{
namespace graphics
{

//=====================================================================
//
//	構造体名	:	ColorChannel
//	処理		:	RED BULE GREEN ALPHAを指定するための一覧
//	製作者		:	立川 翔野
//	作成日		:	2011/06/23	- 作成
//
//=====================================================================
struct ColorChannel
{
//	パブリック	型定義
public:
	enum Type{
		BLUE,
		GREEN,
		RED,
		ALPHA,
		MAX
	};
};

//=====================================================================
//
//	共用体名	:	Color4
//	処理		:	整数型のRED BULE GREEN ALPHAを扱う共用体
//	製作者		:	立川 翔野
//	作成日		:	2011/06/23	- 作成
//
//=====================================================================
union Color4
{
//	パブリック	メンバ変数
public:
	U_CHAR	channel[ ColorChannel::MAX ];	// 1色ずつほしい用
	U_LONG	color;							// 全部まとめてほしい用

//	パブリック	メンバ関数
public:
	//--------------------------------------------------------------------
	// 
	//	処理	:	コンストラクタ(U_LONGで初期化するタイプ)
	//	第1引数	:	[in] setColor	- この色で初期化する
	//	製作者	:	立川 翔野
	//	作成日	:	2011/06/23	- 作成
	// 
	//--------------------------------------------------------------------
	Color4( U_LONG setColor = 0 );

	//--------------------------------------------------------------------
	// 
	//	処理	:	コンストラクタ(U_CHAR×4で初期化するタイプ)
	//	第1引数	:	[in] r	- レッドはこれで初期化する
	//	第2引数	:	[in] g	- グリーンはこれで初期化する
	//	第3引数	:	[in] b	- ブルーはこれで初期化する
	//	第4引数	:	[in] a	- アルファはこれで初期化する
	//	製作者	:	立川 翔野
	//	作成日	:	2011/06/23	- 作成
	// 
	//--------------------------------------------------------------------
	Color4( U_CHAR r, U_CHAR g, U_CHAR b, U_CHAR a = 255 );

	//--------------------------------------------------------------------
	// 
	//	処理	:	引数がU_LONGなところにつっこむとU_LONGとして扱われる
	//	戻り値	:	U_LONG型の色(4色まとめて)
	//	製作者	:	立川 翔野
	//	作成日	:	2011/06/23	- 作成
	// 
	//--------------------------------------------------------------------
	inline	operator U_LONG() const;

	//--------------------------------------------------------------------
	// 
	//	処理	:	配列の添え字アクセスのように一色ずつ色を取得する
	//	戻り値	:	U_CHAR型の色(1色だけ)
	//	製作者	:	立川 翔野
	//	作成日	:	2011/06/23	- 作成
	// 
	//--------------------------------------------------------------------
	inline const U_CHAR&	operator []( UINT getChannel ) const;
};

// インラインメンバ関数の実装
// 引数がU_LONGなところにつっこむとU_LONGとして扱われる
inline Color4::operator U_LONG() const
{
	return color;
}

// 配列の添え字アクセスのように一色ずつ色を取得する
inline const U_CHAR& Color4::operator []( UINT getChannel ) const
{
	return channel[ getChannel ];
}

//=====================================================================
//
// @struct	Color4F
//	処理	:	浮動小数点型のRED BULE GREEN ALPHAを扱う共用体
//	製作者	:	立川 翔野
//	作成日	:	2011/06/23	- 作成
//
//=====================================================================
struct Color4F
{
// ●パブリック		メンバ変数
public:
	float	r;	//< 赤
	float	g;	//< 緑
	float	b;	//< 青
	float	a;	//< 透明度

// ●パブリック		メンバ関数
public:
	//--------------------------------------------------------------------
	// 
	//	処理	:	コンストラクタ(全て0で初期化するタイプ)
	//	製作者	:	立川 翔野
	//	作成日	:	2011/06/23	- 作成
	// 
	//--------------------------------------------------------------------
	Color4F();

	//--------------------------------------------------------------------
	// 
	//	処理	:	コンストラクタ(D3DCOLORVALUEで初期化するタイプ)
	//	製作者	:	立川 翔野
	//	作成日	:	2011/06/23	- 作成
	// 
	//--------------------------------------------------------------------
	Color4F( D3DCOLORVALUE colorValue );

	//--------------------------------------------------------------------
	// 
	//	処理	:	コンストラクタ(一つずつ指定して初期化するタイプ)
	//	第1引数	:	[in] setR	- レッドはこれで初期化する
	//	第1引数	:	[in] setG	- グリーンはこれで初期化する
	//	第1引数	:	[in] setB	- ブルーはこれで初期化する
	//	第1引数	:	[in] setA	- アルファはこれで初期化する
	//	製作者	:	立川 翔野
	//	作成日	:	2011/06/23	- 作成
	// 
	//--------------------------------------------------------------------
	Color4F( float setR, float setG, float setB, float setA );

	//--------------------------------------------------------------------
	// 
	//	処理	:	引数がD3DCOLORVALUEなところにつっこむとD3DCOLORVALUEとして扱われる
	//	戻り値	:	D3DCOLORVALUE型
	//	製作者	:	立川 翔野
	//	作成日	:	2011/06/23	- 作成
	// 
	//--------------------------------------------------------------------
	inline	operator D3DCOLORVALUE() const;
};

// インラインメンバ関数の実装
// 引数がD3DCOLORVALUEなところにつっこむとD3DCOLORVALUEとして扱われる
inline Color4F::operator D3DCOLORVALUE() const
{
	D3DCOLORVALUE	temp;

	temp.r	= r;
	temp.g	= g;
	temp.b	= b;
	temp.a	= a;

	return temp;
}


}	// graphics	end
}	// iruna	end

/*----関数 宣言----------------------------------------------------*/
namespace iruna
{
namespace graphics
{

//--------------------------------------------------------------------
// 
//	処理	:	Color4FからColor4に変換する
//	第1引数	:	[in] colorValue	- 変換したいColor4F
//	戻り値	:	Color4になった色
//	製作者	:	立川 翔野
//	作成日	:	2011/06/23	- 作成
// 
//--------------------------------------------------------------------
inline const Color4 ToColor4( const Color4F& colorValue )
{
	return Color4( static_cast< U_CHAR >( colorValue.r * 255.f ),
				   static_cast< U_CHAR >( colorValue.g * 255.f ),
				   static_cast< U_CHAR >( colorValue.b * 255.f ),
				   static_cast< U_CHAR >( colorValue.a * 255.f ));
}

//--------------------------------------------------------------------
// 
//	処理	:	Color4からColor4Fに変換する
//	第1引数	:	[in] color4	- 変換したいColor4
//	戻り値	:	Color4Fになった色
//	製作者	:	立川 翔野
//	作成日	:	2011/06/23	- 作成
// 
//--------------------------------------------------------------------
inline const Color4F ToColor4F( const Color4& color4 )
{
	return Color4F( color4[ ColorChannel::RED   ] / 255.f,
					color4[ ColorChannel::GREEN ] / 255.f,
					color4[ ColorChannel::BLUE  ] / 255.f,
					color4[ ColorChannel::ALPHA ] / 255.f);
}


}	//	graphics	end
}	//	iruna		end

#endif	//	IRUNA_COLOR4_H	end