//---------------------------------------------------------
// 
//	iruna_quaternion.h
//	クォータニオン関連
//	作成日 7月10日
//	製作者 立川 翔野
// 
//---------------------------------------------------------

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_QUATERNION_H
#define IRUNA_QUATERNION_H

/*----データ型宣言-------------------------------------------------*/
namespace iruna
{
namespace math
{

//---------------------------------------------------------
// 
//	クラス名	:	Quaternion
//	作成日		:	7月10日
//	製作者		:	立川 翔野
// 
//---------------------------------------------------------
typedef	D3DXQUATERNION 	Quaternion;

}	//	math	end
}	//	iruna	end

#endif	//	IRUNA_QUATERNION_H	end