//---------------------------------------------------------
// 
//	iruna_vector2.h
//	ベクトル2関連
//	作成日 6月22日
//	製作者 立川 翔野
// 
//---------------------------------------------------------

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_VECTOR2_H
#define IRUNA_VECTOR2_H

namespace iruna
{
namespace math
{

//---------------------------------------------------------
// 
//	クラス名	:	Vector2
//	作成日		:	6月23日
//	製作者		:	立川 翔野
// 
//---------------------------------------------------------
typedef	D3DXVECTOR2	Vector2;

}	//	math	end
}	//	iruna	end

#endif	//	IRUNA_VECTOR2_H